def eratosthenes(N):
    primes = [i for i in range(N + 1)]
    primes[1] = 0
    i = 2
    while i <= N:
        # Если значение текущей ячейки до этого не было обнулено,
        # значит в этой ячейке содержится простое число
        if primes[i] != 0:
            # Первое кратное ему будет в два раза больше
            j = i + i
            while j <= N:
                # и это число составное,
                # поэтому заменяем его нулем
                primes[j] = 0
                # переходим к следующему числу,
                # которое кратно i (оно на i больше)
                j += i
        i += 1

    # Избавляемся от всех нулей в списке
    primes = [i for i in primes if i != 0]
    return primes
#
# print(eratosthenes(10))











