def n_cheese(func): # Создание функции декоратора, в func будет лежать прикрепляемая функция
    def wrapper(): # Функция обертка в ней вызывается наша функция
        print("Варим макароны, трём сыр. Получаем:")
        print(func() + " с сыром!")
        print("Приятного аппетита!")
    return wrapper # Возврат функции обертки с встроенной нашей функцией

@n_cheese # Вызов декоратора и изменений функции ниже на модифицированную обертку
def mac():
    return "Макароны"

mac() # Вызывается функция обертка с учетом вызова первозданной функции mac


