# Генератор - это объект питона который позволяет проитерироваться по нему
# Итерация - это 1 повтор цикла
# Итерирование - это проход цикла

# Создание генератора
nums = (x for x in range(10))
print(nums) # Объект генератора

# Используя next можно пробегаться по генератору
print(next(nums))
print(next(nums))
print(next(nums))

list_nums = list(nums) # Превращает остатки генератора в список
print(list_nums)


# Как создать генератор чисел от 0 до n-1
def generator(n):
    for i in range(n):
        yield i # Возвращает последовательно (например при вызове функции next()

# Любая фукнция содержащая yield считается итерируемой и по ней можно пробежать например циклом for