# Класс - это коробка хранящая переменные и функции под определенным названием
# Класс - это чертеж готовых продуктов (объектов класса)
# Атрибут - переменная внутри класса и вызывается через . от объекта класса
# Метод - функция внутри класса и вызывается через . от объекта класса
# __init__ - это метод который исполняется вместо надписи Название_класса()
# self - это аргумент который хранит объект класса

class Player: # Создание класса (чертежа)
    def __init__(self, name, hp, dmg): # в аргумент self кладется объект класса (player1 или player2)
        self.name = name
        self.hp = hp
        self.dmg = dmg # создание атрибута dmg со значением из аргумента dmg
        self.lvl = 1
        self.exp = 0 # создание атрибута exp со значением 0

    def stats(self): # в аргумент self кладется объект класса (player1 или player2)
        print(self.name)
        print(self.hp)
        print(self.dmg)
        print(self.lvl)
        print(self.exp)

player1 = Player('Ruslan', 100, 10) # Создание объекта класса
player1.stats() # вызов метода


player2 = Player('Danil', 1000, 100) # Создание 2-го объекта класса
player2.stats()

