# Методы подстановки позволяют вставвить переменную или выражение прямо внутрь строки
# Всего из 3 штуки

# Конкатенация - прямое сложение строк (нельзя складывать строки и другие типы данных напрямую)
name = 'Глеб'
print('Привет, '+name)
age = 13
print('Мне '+str(age)+' лет.')

# %s - позволяет вставить внутрь строки в позиции %s-ок переданные переменные или выражения
name = 'Глеб'
print('Привет, %s' % name)
age = 13
print('Мне %s лет.' % age)
print('Привет, %s. Мне тоже %s лет.' % (name,age))
text = 'Привет, %s. Мне тоже %s лет.'
print(text % (name,age))

# f-строка - позволяет вставить внутрь строки в позиции фиг. скобок {} переданные переменные или выражения
name = 'Глеб'
print(f'Привет, {name}')
age = 13
print(f'Мне {age} лет.')
print(f'Привет, {name}. Мне тоже {age} лет.')
