
#       01234 - индексы строки
name = 'Данила'

print(name[0]) #- Вывести 0 индекс строки (букву "Д")

print(name[0:3]) # - Вывести срез букв от 1-ой до 3-ей.

print(name.find('а')) # - Найти и вывести индекс самой первой буквы "а"
print(name.rfind('а')) # - Найти и вывести индекс последней буквы "а"


#       Методы подстановки - вставляем переменную внутрь строки
print(f'Привет {name}. Как дела?') # Используя f-строку, в начале строки пишем f, в самой строке выводим переменную с помощью {}

print('Привет %s,%s. Как дела?' % (name,name)) # Используя %s, внутри строки пишем %s, после строки дописываем переменные по порядку с помощью % ()
