# Функция - это коробка хранящая целый код под определенным названием
# Чтобы исполнить код внутри функции надо ее ВЫЗВАТЬ, написав название и ()
# Аргумент - это переменная созданная внутри скобок функции, получающая значение при вызове и доступная только внутри тела функции

def func1(): # Создание функции, при создании код внутри не исполнится
    print('Я исполню тело при вызове') # Тело функции

print('1')
func1() # Вызов функции, тут код внутри функции исполнится


def args_func(arg1): # Создание функции с аргументом
    print('В моем аргументе лежит', arg1) # Использование аргумента

args_func('Мой первый аргумент') # Вызов функции и присвоение в аргумент
args_func(1)
args_func([])

def args_func2(arg1, arg2, arg3 = 'Значение по умолчанию'): # Аргументов может быть сколько угодно
    print(arg1, arg2, arg3)

args_func2(1,2,3) # Вызов функции с множественным присвоением в аргументы
args_func2((),()) # Решил не менять arg3
args_func2([],[],'Решил поменять значение arg3')

num1 = 0 # внешняя переменная
def func_with_global():
    global num1 # делаем так, чтобы внутри функции внешняя переменная была доступна
    num1+=5

func_with_global()
print(num1) # Видим что внешняя переменная поменялась



a = input()
print('В a лежит', a)

def return_func():
    return 'Я вернусь на место вызове функции' # Возвращает переданное на место вызова функции

res = return_func() # Вместо вызова появится то что передано в return
print(res)