# Цикл for пробегается по хранилищу и кладет его элементы поочереди в свою переменную
# Цикл for повторяет код внутри себя столько раз сколько в хранилище элементов.

for x in range(10): # Создает последовательность чисел от 0 до переданного числа
    print(x) # Эта строка будет посторяться 10 раз
print()
for x in range(2, 10): # Если добавить число в начало, то начало последовательности будет не 0, а переданное число
    print(x)
print()
for x in range(2, 10, 2): # Если указать 3 числа, то можно добавить шаг, с которым будет создаваться последовательность
    print(x)
print()
for letter in 'Hello':
    print(letter)
print()
for elem in [1,2,3,4,5]:
    print(elem)